//Да се напише програма на С, която използвайки системни примииви за работа с файлове, чете
//последователн по един символ от файл, чието име е подадено като първи позиционен парамртър
// и по един символ от ст.вход. Добавя прочетените символи, премахвайки, '0','1','2','3','4'
// '5','6','7','8','9', последователно след края на файл, чието име е подадено като втори параметър
//ако файлът не съществува се създава. Чете се до достигане на края на файла или до изчерпване на входния поток
#include <stdio.h>
#include <fcntl.h>
#include <sys/types.h>
#include <unistd.h>
int main(int argc,char *argv[])
{
	int fd=open(argv[1],O_RDONLY);
	if(fd==-1)
	{
		return 1;
	}
	int fd2=open(argv[2],O_CREAT | O_WRONLY | O_APPEND, 0664);
	if(fd2==-1)
	{
		return 1;
	}

	char c1;
	char c2;
	while(read(fd,&c1,1) && read(0,&c2,1))
	{
		if(!(c1 >='0' && c1<='9'))
		{
			write(fd2,&c1,1);
		}
		
		if(!(c2 >='0' && c2<='9'))
		{
			write(fd2,&c2,1);
		}
	}
	close(fd);
	close(fd2);
		
	return 0;
}
